# Feature Transformations

- To convert Right skew to normal distribution we need to use nth root or log(x)
- To convert Left skew to normal distribution we need to use nth power or exp(x)

In [1]:
import numpy as np
import pandas as pd

In [3]:
data = pd.read_csv("titanic.csv")

data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
data = pd.read_csv("titanic.csv", usecols = ["Fare"])

data.head()

      Fare
0   7.2500
1  71.2833
2   7.9250
3  53.1000
4   8.0500

In [5]:
data["Fare"].skew()

4.787316519674893

In [6]:
data["Fare"].min()

0.0

## Logarithmic Transformation.

In [11]:
data["Log_Fare"] = np.log(data["Fare"]+0.0000001) ## If you do not add 0.0001 log(1) will give infinity. and code will through error. 

data["Log_Fare"].skew()

-6.068868405345345

## Root Transformation.

In [15]:
data["sqr_Fare"] = data["Fare"]**(1/4.71)   #you need to try different n value untill you get close to 0 answer. 

data["sqr_Fare"].skew()

0.002434496008148313

## BoxCox

The Box-Cox transformation is defined as::

![title](BoxCox.png)

Where Y is the response variable and  λ is the transformation parameter.  λ  varies from -5 to 5. In the transforamtion, all values of  λ  are considered and optimal value for a given variable is selected.

In [17]:
from scipy.stats import boxcox

In [22]:
# Transform training data and save lambda value. 

data["Fare_boxcox"], param = boxcox(data.Fare+0.01)

In [23]:
print(" λ =", param)

 λ = 0.18091321955494596

In [24]:
data["Fare_boxcox"].skew()

0.25282461235568676